牛排 =  450
魚排 = 200
豬排 = 350
升級 = 100
eat = input("請問你要吃哪一樣餐點？[A]牛排 [B]豬排 [C]魚排：").upper()
extra = input("請問有需要升級套餐嗎？[Y] [N]：").upper()
if eat == 'A':
    if extra =='Y':
        print(f"您今天用餐的品項為{"【牛排升級套餐】"}，價格為{牛排+升級}元")
    else:
        print(f"您今天用餐的品項為{"【牛排】"}，價格為{牛排}元")

elif eat == 'B':
        if extra =='Y':
            print(f"您今天用餐的品項為：{"【豬排升級套餐】"}，價格為{豬排+升級}元")
        else:
            print(f"您今天用餐的品項為：{"【豬排】"}價格為{豬排}元")
else:
    if extra =='Y':
        print(f"您今天用餐的品項為：{"【魚排升級套餐】"}，價格為{魚排+升級}元")
    else:
        print(f"您今天用餐的品項為：{"【魚排】"}價格為{魚排}元")
